mengqy2022/ESP32-S3-XMMZ/sdkconfig.defaults
# ===== Target =====
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# ===== 分区表 (自定义: 8MB 应用 + 4MB 存储) =====
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ===== Flash / PSRAM (N16R8: 16MB QIO flash + 8MB OPI PSRAM) =====
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
# 所有普通 malloc 优先走 PSRAM, 保护内部 RAM (防内存耗尽卡死)
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0

# ===== CPU / Compiler performance (NES 需要) =====
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ===== FreeRTOS / perf =====
CONFIG_FREERTOS_HZ=1000
# main 栈不能加: 内部 RAM 仅 ~190KB, 8KB→16KB 会挤爆 wifi_init (ESP_ERR_NO_MEM→abort→重启循环)
# 屏保壁纸栈溢出另想办法 (独立任务/缩图), 不再靠加大 main 栈
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ===== Components used =====
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# ===== Console / logging =====
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ===== NVS =====
CONFIG_NVS_ENCRYPTION=n

# ===== FATFS (SD 卡) =====
# 启用长文件名 (LFN, UTF-8): 支持中文文件名 (音乐/壁纸/书籍)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
# SD 卡长文件名统一使用 UTF-8 API，避免中文/非 ASCII 文件名在图库、音乐、NES 扫描后打不开。
# CONFIG_FATFS_API_ENCODING_ANSI_OEM is not set
CONFIG_FATFS_API_ENCODING_UTF_8=y

# ===== ADC (battery) =====
CONFIG_ADC_DISABLE_DAC_OUTPUT=y

# ===== RMT (WS2812B) =====
CONFIG_RMT_ISR_IRAM_SAFE=y

# ===== 蓝牙 BLE =====
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
# BT 钉到核心 1, 避免与核心 0 的 SPI 渲染争抢导致刷新饿死
CONFIG_BT_BLUEDROID_PINNED_TO_CORE_1=y
CONFIG_BT_CTRL_PINNED_TO_CORE_1=y
CONFIG_BT_ACL_CONNECTIONS=2
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_42_ADV_EN=y
CONFIG_BT_BLE_42_SCAN_EN=y

# ===== LVGL (v9) =====
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_USE_LOG=n
# SD 卡壁纸: 文件系统 (P: -> /sdcard, 字母是 ASCII 码 80='P') + JPEG 解码
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=80
CONFIG_LV_FS_POSIX_PATH="/sdcard"
CONFIG_LV_USE_TJPGD=y
